app/controllers/produtos_controller.rb

SELECT "produtos".* FROM "produtos"
---
  def index
    @produtos = Produto.all

INSERT INTO "produtos" ("nome", "preco", "link", "descricao", "created_at", "updated_at") VALUES ('Fralda Pampers Pants Premium Care XXG 60 unidades', '181,61', 'https://meli.la/2qbPdxU', '15% de desconto. Loja oficial Pampers', '2026-06-22 00:18:53.709687', '2026-06-22 00:18:53.709687') RETURNING "id"
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save

UPDATE "produtos" SET "updated_at" = '2026-06-22 01:52:45.862255' WHERE "produtos"."id" = 1
---
  def update
    respond_to do |format|
      if @produto.update(produto_params)

SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = 1 LIMIT 1
---
    def set_produto
      @produto = Produto.find(params.expect(:id))