app/controllers/tarefas_controller.rb

SELECT "tarefas".* FROM "tarefas"
---
  def index
    @tarefas = Tarefa.all

INSERT INTO "tarefas" ("titulo", "descricao", "created_at", "updated_at") VALUES ('Achadinhos ECHOLOGIC', 'O mundo de opções que você merece', '2026-06-21 23:00:38.126217', '2026-06-21 23:00:38.126217') RETURNING "id"
---
  def create
    @tarefa = Tarefa.new(tarefa_params)

    respond_to do |format|
      if @tarefa.save

DELETE FROM "tarefas" WHERE "tarefas"."id" = 1
---
  def destroy
    @tarefa.destroy!

SELECT "tarefas".* FROM "tarefas" WHERE "tarefas"."id" = 1 LIMIT 1
---
    def set_tarefa
      @tarefa = Tarefa.find(params.expect(:id))